{
      "intro":
        [ "Beginnings"
        , ""
        , "    You are a novice mage who, after an argument with one of your instructors,  "
        , "decided to explore a cave which you had discovered the previous week during a   "
        , "class trip to the Enchanted Wood. The instructor guiding the trip had claimed   "
        , "the cave contained the entrance to Hell, after chewing you out for wandering off"
        , "by yourself and somehow getting yourself into the high security area of the     "
        , "Enchanted Wood. Of course, you think that the whole 'entrance to hell' thing is "
        , "a load of hogwash, but you do think that there must be something inside the cave"
        , "worth seeing if the instructors thought it dangerous enough to tell such an     "
        , "unbelievable tale to prevent people from entering the cave.                     "
        , "    Once you enter the cave, having once again avoided the guards in the wood,  "
        , "you enter the cave. After walking for what seems to you like hours, the cave    "
        , "opens out into what appears to be a temple to the dark gods. The whole hall is  "
        , "carved of a jet-black marble, run through with streaks of a fiery red. Near the "
        , "back of the hall burns a bright orange flame, which appears to you to be over   " 
        , "twenty meters tall. The ceiling arches high over your head, seemingly larger    " 
        , "than could be contained in the small hill in which the entrance to the cave was "
        , "embedded. You realized that the cave must have been slowly slopping down the    "
        , "whole time you were walking. Fascinated by the hints of some large, evil looking"
        , "magical symbols behind the flame, you start forward. Almost immediately, a trap "
        , "door opens underneath you, and you feel your self falling...."
        , ""
        , "    You wake up in a room of red brick. Looking around you, find that there is  "
        , "no way out of the room but the doors you see around you. Resigned to you fate,  "
        , "you stand up and cast a mage light that will keep any room you enter alight. Now"
        , "you really wished that you had paid attention in the 'Self-Defense Against      "
        , "Malicious Magical Menaces' class. Heck, even attending the class could have     "
        , "helped you out. But it is too late for rumination. Now, you must face the demons"
        , "of hell armed only with your brains, your fists, and your staff."
        , ""
        , "Click to continue."
        ]
    , "first_open_door":
        [ "    You open the door to find yourself confronting a rather large spider. As the"
        , "beast charges towards you, you feel certain you are going to die. You really,   "
        , "really, really, wish you had attended those defense classes. Just as you consign"
        , "yourself to death, you have an idea. If you could harden the air around yourself"
        , "maybe, just maybe, you can survive. Speaking as fast as you can, you construct  "
        , "a shield around yourself that will use your life force to prevent anything from "
        , "entering the air within a few centimeters of your body. Unfortunately, in your  "
        , "haste, you construct the spell in such a way that you cannot dispel it and there"
        , "is no limit to the amount of energy it will take from your body. You realize    "
        , "that you are now fully committed: If you are hit too hard or too rapidly, you   "
        , "will die of exhaustion. Hopefully the instructors at the Institute will be able "
        , "to tell you how to dispel your shield..."
        , ""
        , "You can now punch demons with impunity." 
        , ""
        , "Click to continue"
        ]
    , "first_level_up":
        [ "    As the spider falls to the floor, bleeding from where your fists pounded into" 
        , "it, you stumble a few steps backward, shocked that not only were you still alive,"
        , "you were able to defeat the beast."
        , "    You suddenly feel a tingle run through your body from your toes to your     "
        , "fingers, and sparks of color run across your shield. You feel a sudden surge of "
        , "power, and somehow know that you have now ''leveled up.'' Your shield seems to  "
        , "to have thickened. When you punch floor, you realize you have also gotten"
        , "stronger"
        , ""
        , "Click to continue"
        ]
    , "player_death":
        [ "You died"
        , ""
        , "    As the world fades to blackness around you, you reflect that sometimes, "
        , "listening to teachers is indeed a good idea."
        , ""
        , "Clicking will crash the game. If you want to play again, relaunch."
        ]
    , "circle_2":
        [ "    You peer cautiously down the stairs. You know that going down is probably"
        , "not a great idea, but what can you do? You have explored most, if not all, of"
        , "this level of the temple and found nothing. It appears that the only way     "
        , "forward is down. So, throwing back you shoulders and holding your witchlight "
        , "high, you step down the stairs."
        , ""
        , "    As you step off the last of the stairs, you see the tail of an imp       "
        , "scampering away from you. You groan to yourself. Even the tame ones that act "
        , "as servants in the Institute were irritating buggers. These imps, which had  "
        , "probably never even seen the light of day, were probably several orders of   "
        , "magnitude more annoying. and, you remind yourself, more deadly. Just as you  "
        , "think that it can't get any worse, the stairs you came down fall, merging    "
        , "seamlessly into the floor. Groaning once more, you steady yourself and set off"
        , "into the dungeon."
        , ""
        , "Click to continue."
        ]
    , "circle_3":
        [ "     By this time, you feel you are an old hand at this whole ''adventuring''"
        , "thing. You have fought hand to leg with giant spiders, and beaten off hoards "
        , "of imps. What could you possibly face that would be worse? Just then, a great"
        , "wall of stench hits your nose. Groaning to yourself, you wish you hadn't     "
        , "opened your big mouth. Cyclopes were some of the nastiest creatures in the   "
        , "known multiverse, worlds-renowned for their dismal hygiene and worse tempers."
        , "Some claimed that they had a soft spot for maple syrup, but you don't have   "
        , "any on you. Feeding a little more power to your shield, you step of the      "
        , "stairs onto the deep blue floor. You are hardly surprised when the stairs    "
        , "behind you fall and merge into the floor. Trying not to let yourself think   "
        , "about all of the blood and skulls scattered over the floor, you steel yourself"
        , "and set off."
        , ""
        , "Click to continue."
        ]
     , "circle_4":
        [ "     Looking around at the room that you have just stepped into, you can't   "
        , "help but shudder a little. This level is decidedly colder than the previous  "
        , "three. The bricks that make up the floor and walls here seem to suck you in, "
        , "and threaten to mesmerize anyone who stares at them for too long. Once again,"
        , "as you step off the stairs they disappear. The only difference is that this  "
        , "set was silent. You slowly realize that while the other floors had had some  "
        , "level of ambient noise, this floor had none. Everything was still, black, and"
        , "thoroughly creepy. Jumping on your toes a little, you set off into the dungeon"
        , ""
        , "Click to continue"
        ]
    , "win":
        [ "     Staring with trepidation into the swirling purple portal, you wonder where"
        , "it leads. You know that entering random portals is way up there on the list of"
        , "Thing Not To Do In Strange Places, but you see little choice. Unless another  "
        , "stairway appears magically, you see no other way out of this horrible darkness"
        , "and even now you hear more of the skeletal beasts clacking through the halls  "
        , "towards you. Making a snap decision, you jump through the portal."
        , ""
        , "     As you come to, you are blinded by a bright light. Shading your eyes, you"
        , "stand up groggily. As you look around, you see that you are in the middle of a"
        , "field, with wild flowers and grasses growing around you. You realize that you "
        , "are standing in The Children's Meadow, the field in which the children of the "
        , "professors and the magically talented urchins that the Institute adopted were "
        , "kept. You see a figure in the black robes of a professor storming towards you "
        , "waving his arms and shouting angrily. You have never been more relieved to    "
        , "receive a good shouting at in your life."
        , ""
        , "                                The End"
        , ""
        , "     While the story ends here, you may continue playing. Click to continue!  "
        ] 
}